movuino/OpenHealthBandFirmware/Arduino variant board definition/boards.txt
# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
mdbt50qrx.vid.0=0x239A
mdbt50qrx.pid.0=0x8029
mdbt50qrx.vid.1=0x239A
mdbt50qrx.pid.1=0x0029
mdbt50qrx.vid.2=0x239A
mdbt50qrx.pid.2=0x002A
mdbt50qrx.vid.3=0x239A
mdbt50qrx.pid.3=0x802A

# Upload
mdbt50qrx.bootloader.tool=bootburn
mdbt50qrx.upload.tool=nrfutil
mdbt50qrx.upload.protocol=nrfutil
mdbt50qrx.upload.use_1200bps_touch=true
mdbt50qrx.upload.wait_for_upload_port=true
mdbt50qrx.upload.maximum_size=815104
mdbt50qrx.upload.maximum_data_size=237568

# Build
mdbt50qrx.build.mcu=cortex-m4
mdbt50qrx.build.f_cpu=64000000
mdbt50qrx.build.board=MDBT50Q_RX
mdbt50qrx.build.core=nRF5
mdbt50qrx.build.variant=raytac_mdbt50q_rx
mdbt50qrx.build.usb_manufacturer="Raytac Corporation"
mdbt50qrx.build.usb_product="Raytac MDBT50Q - RX"
mdbt50qrx.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
mdbt50qrx.build.ldscript=nrf52840_s140_v6.ld
mdbt50qrx.build.vid=0x239A
mdbt50qrx.build.pid=0x8029

# SofDevice Menu
mdbt50qrx.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
mdbt50qrx.menu.softdevice.s140v6.build.sd_name=s140
mdbt50qrx.menu.softdevice.s140v6.build.sd_version=6.1.1
mdbt50qrx.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
mdbt50qrx.menu.debug.l0=Level 0 (Release)
mdbt50qrx.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
mdbt50qrx.menu.debug.l1=Level 1 (Error Message)
mdbt50qrx.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
mdbt50qrx.menu.debug.l2=Level 2 (Full Debug)
mdbt50qrx.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
mdbt50qrx.menu.debug.l3=Level 3 (Segger SystemView)
mdbt50qrx.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
mdbt50qrx.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Movuino Open Health Band v0.2.7.2
# ----------------------------------
movuinoOHB273.name=Movuino Open Health Band v0.2.7.2

# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
movuinoOHB272.vid.0=0x239A
movuinoOHB272.pid.0=0x8029
movuinoOHB272.vid.1=0x239A
movuinoOHB272.pid.1=0x0029
movuinoOHB272.vid.2=0x239A
movuinoOHB272.pid.2=0x002A
movuinoOHB272.vid.3=0x239A
movuinoOHB272.pid.3=0x802A

# Upload
movuinoOHB272.bootloader.tool=bootburn
movuinoOHB272.upload.tool=nrfutil
movuinoOHB272.upload.protocol=nrfutil
movuinoOHB272.upload.use_1200bps_touch=true
movuinoOHB272.upload.wait_for_upload_port=true
movuinoOHB272.upload.maximum_size=815104
movuinoOHB272.upload.maximum_data_size=237568

# Build
movuinoOHB272.build.mcu=cortex-m4
movuinoOHB272.build.f_cpu=64000000
movuinoOHB272.build.board=NRF52840_FEATHER
movuinoOHB272.build.core=nRF5
movuinoOHB272.build.variant=movuinoOHB272
movuinoOHB272.build.usb_manufacturer="Adafruit LLC"
movuinoOHB272.build.usb_product="Feather nRF52840 Express"
movuinoOHB272.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
movuinoOHB272.build.ldscript=nrf52840_s140_v6.ld
movuinoOHB272.build.vid=0x239A
movuinoOHB272.build.pid=0x8029

# SofDevice Menu
movuinoOHB272.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
movuinoOHB272.menu.softdevice.s140v6.build.sd_name=s140
movuinoOHB272.menu.softdevice.s140v6.build.sd_version=6.1.1
movuinoOHB272.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
movuinoOHB272.menu.debug.l0=Level 0 (Release)
movuinoOHB272.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
movuinoOHB272.menu.debug.l1=Level 1 (Error Message)
movuinoOHB272.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
movuinoOHB272.menu.debug.l2=Level 2 (Full Debug)
movuinoOHB272.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
movuinoOHB272.menu.debug.l3=Level 3 (Segger SystemView)
movuinoOHB272.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
movuinoOHB272.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1
# ----------------------------------
# Movuino Open Health Band v0.2.7.4
# ----------------------------------
movuinoOHB274.name=Movuino Open Health Band v0.2.7.4

# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
movuinoOHB274.vid.0=0x239A
movuinoOHB274.pid.0=0x8029
movuinoOHB274.vid.1=0x239A
movuinoOHB274.pid.1=0x0029
movuinoOHB274.vid.2=0x239A
movuinoOHB274.pid.2=0x002A
movuinoOHB274.vid.3=0x239A
movuinoOHB274.pid.3=0x802A

# Upload
movuinoOHB274.bootloader.tool=bootburn
movuinoOHB274.upload.tool=nrfutil
movuinoOHB274.upload.protocol=nrfutil
movuinoOHB274.upload.use_1200bps_touch=true
movuinoOHB274.upload.wait_for_upload_port=true
movuinoOHB274.upload.maximum_size=815104
movuinoOHB274.upload.maximum_data_size=237568

# Build
movuinoOHB274.build.mcu=cortex-m4
movuinoOHB274.build.f_cpu=64000000
movuinoOHB274.build.board=NRF52840_FEATHER
movuinoOHB274.build.core=nRF5
movuinoOHB274.build.variant=movuinoOHB274
movuinoOHB274.build.usb_manufacturer="Adafruit LLC"
movuinoOHB274.build.usb_product="Feather nRF52840 Express"
movuinoOHB274.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
movuinoOHB274.build.ldscript=nrf52840_s140_v6.ld
movuinoOHB274.build.vid=0x239A
movuinoOHB274.build.pid=0x8029

# SofDevice Menu
movuinoOHB274.menu.softdevice.s140v6=0.3.2 SoftDevice s140 6.1.1
movuinoOHB274.menu.softdevice.s140v6.build.sd_name=s140
movuinoOHB274.menu.softdevice.s140v6.build.sd_version=6.1.1
movuinoOHB274.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
movuinoOHB274.menu.debug.l0=Level 0 (Release)
movuinoOHB274.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
movuinoOHB274.menu.debug.l1=Level 1 (Error Message)
movuinoOHB274.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
movuinoOHB274.menu.debug.l2=Level 2 (Full Debug)
movuinoOHB274.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
movuinoOHB274.menu.debug.l3=Level 3 (Segger SystemView)
movuinoOHB274.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
movuinoOHB274.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1